spec/spec/SVWS/IntegrationPlatform/Examples/ExternalAccountBankTransferRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://sv.bpc.in/SVIP">
    <soapenv:Header/>
    <soapenv:Body>
    <int:IFX>
    <PmtAddRq>
        <RqUID>3127a63b-d8f1-4bed-94ad-d96ffd321a86</RqUID>
        <MsgRqHdr>
            <ContextRqHdr>
                <NetworkTrnData>
                    <NetworkOwner>Branch</NetworkOwner>
                    <TerminalIdent>10000073</TerminalIdent>
                </NetworkTrnData>
                <ClientDt>2011-08-08T12:45:45</ClientDt>
            </ContextRqHdr>
        </MsgRqHdr>
        <PmtInfo>
            <CurAmt>
                <Amt>1000</Amt>
                <CurCode>
                    <CurCodeValue>RUB</CurCodeValue>
                </CurCode>
            </CurAmt>

            <CPPData>
                <OrgData>
                    <IssuedIdent>
                        <IssuedIdentType>BIC</IssuedIdentType>
                        <IssuedIdentValue>048357</IssuedIdentValue>
                    </IssuedIdent>
                    <IssuedIdent>
                        <IssuedIdentType>BankCorrAcct</IssuedIdentType>
                        <IssuedIdentValue>30101810300000000202</IssuedIdentValue>
                    </IssuedIdent>
                    <IssuedIdent>
                        <IssuedIdentType>BankName</IssuedIdentType>
                        <IssuedIdentValue>BankNameValue</IssuedIdentValue>
                    </IssuedIdent>
                    <IssuedIdent>
                        <IssuedIdentType>BankBranchName</IssuedIdentType>
                        <IssuedIdentValue>BankBranchNameValue</IssuedIdentValue>
                    </IssuedIdent>
                    <IssuedIdent>
                        <IssuedIdentType>BkPtyId</IssuedIdentType>
                        <IssuedIdentValue>40817810020002354678</IssuedIdentValue>
                    </IssuedIdent>
                    <IssuedIdent>
                        <IssuedIdentType>TaxIdNb</IssuedIdentType>
                        <IssuedIdentValue>779475763892</IssuedIdentValue>
                    </IssuedIdent>
                    <OrgName>
                        <LegalName>Payment recepient name</LegalName>
                    </OrgName>
                </OrgData>
            </CPPData>

            <DebtorData>
                <PersonData>
                    <PersonName>
                        <FullName>Nikolaev Nikolay</FullName>
                    </PersonName>
                </PersonData>
            </DebtorData>
            <PmtInstruction>
                <PmtMethod>Electronic</PmtMethod>
                <FromAcctRef>
                    <AcctKeys>
                        <AcctIdent>
                            <AcctIdentType>AcctNum</AcctIdentType>
                            <AcctIdentValue>40817810020000127849</AcctIdentValue>
                        </AcctIdent>
                    </AcctKeys>
                </FromAcctRef>
                <Memo>Payment for something</Memo>
                <RefData>
                      <RefType>PurposeSpecific</RefType>
                      <RefIdent>10000002</RefIdent>
                </RefData>
            </PmtInstruction>
            <PrcDt>2011-08-08T12:45:45Z</PrcDt>
        </PmtInfo>
    </PmtAddRq>
    </int:IFX>
    </soapenv:Body>
</soapenv:Envelope>